{"id":"c57b4580-94f6-11ee-b4f8-6d1e4b5002e5","updated_at":"2023-12-07T13:07:17.393Z","updated_by":"elastic","created_at":"2023-12-07T11:50:09.115Z","created_by":"elastic","name":"External Alerts Kismet","tags":["OS: Windows","Data Source: APM","OS: macOS","OS: Linux"],"interval":"1m","enabled":true,"revision":5,"description":"Generates a detection alerts for each kismet alert written to the `logs-kismet*` index. Severity is translated from kismet's severity values.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":"","meta":{"from":"1m","kibana_siem_app_url":""},"rule_name_override":"kismet.alert.header","timestamp_override":"event.ingested","timestamp_override_fallback_disabled":false,"investigation_fields":{"field_names":["kismet.alert.header","kismet.alert.source_mac","kismet.alert.transmitter_mac","kismet.alert.dest_mac","kismet.alert.class","kismet.alert.text"]},"author":["Elastic"],"false_positives":[],"from":"now-120s","rule_id":"274d020b-c439-4623-9d18-62ce619e76e5","max_signals":10000,"risk_score_mapping":[{"field":"event.risk_score","operator":"equals","value":""}],"severity_mapping":[{"field":"kismet.alert.severity","operator":"equals","severity":"low","value":"5"},{"field":"kismet.alert.severity","operator":"equals","severity":"medium","value":"10"},{"field":"kismet.alert.severity","operator":"equals","severity":"high","value":"15"},{"field":"kismet.alert.severity","operator":"equals","severity":"critical","value":"20"}],"threat":[],"to":"now","references":["https://www.kismetwireless.net/docs/readme/alerts/alerts/"],"version":102,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["logs-kismet*"],"query":"event.kind:alert and not event.module:(endgame or endpoint or cloud_defend)\n","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
